zup/ЗУП_бюджет/src/InformationRegisters/ПолучателиГрантов/ПолучателиГрантов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПолучателиГрантов</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЯвляетсяПолучателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Грант</name>
    <type>
      <types>CatalogRef.Гранты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/Enums/КатегорииНачисленийИНеоплаченногоВремени/КатегорииНачисленийИНеоплаченногоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииНачисленийИНеоплаченногоВремени</name>
  <enumValues>
    <name>ПовременнаяОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>СдельнаяОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>ОплатаТрудаВНатуральнойФорме</name>
  </enumValues>
  <enumValues>
    <name>ДоходВНатуральнойФорме</name>
  </enumValues>
  <enumValues>
    <name>КомпенсационныеВыплаты</name>
  </enumValues>
  <enumValues>
    <name>Премия</name>
  </enumValues>
  <enumValues>
    <name>КвартальнаяПремия</name>
  </enumValues>
  <enumValues>
    <name>РайонныйКоэффициент</name>
  </enumValues>
  <enumValues>
    <name>СевернаяНадбавка</name>
  </enumValues>
  <enumValues>
    <name>УправленческийУчет</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеНаПериодОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеКомпенсацияОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ОплатаОтпуска</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ЕдиновременнаяВыплатаКОтпускуГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>ЕдиновременнаяВыплатаКОтпуску</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощьПриОтпускеГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощьПриОтпуске</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>НеявкаПоБолезни</name>
  </enumValues>
  <enumValues>
    <name>НеявкаПоНевыясненнымПричинам</name>
  </enumValues>
  <enumValues>
    <name>Прогул</name>
  </enumValues>
  <enumValues>
    <name>ПростойПоВинеРаботника</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПростояПоВинеРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПростояПоНезависящимОтРаботодателяПричинам</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеНаПериодКомандировки</name>
  </enumValues>
  <enumValues>
    <name>ОплатаКомандировки</name>
  </enumValues>
  <enumValues>
    <name>СохраняемоеДенежноеСодержание</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоСреднемуЗаработку</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоСреднегоЗаработка</name>
  </enumValues>
  <enumValues>
    <name>ОплатаСверхурочныхВоеннослужащим</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодамВоеннослужащего</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоЛиста</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоЛистаЗаСчетРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоПрофзаболевание</name>
  </enumValues>
  <enumValues>
    <name>ОплатаБольничногоНесчастныйСлучайНаПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоСреднегоЗаработкаЗаДниБолезни</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеОплатаДнейУходаЗаДетьмиИнвалидами</name>
  </enumValues>
  <enumValues>
    <name>ОплатаДнейУходаЗаДетьмиИнвалидами</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДоПолутораЛетВоеннослужащим</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДоПолутораЛет</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДоТрехЛет</name>
  </enumValues>
  <enumValues>
    <name>ВыходноеПособиеМесячноеДенежноеСодержание</name>
  </enumValues>
  <enumValues>
    <name>ВыходноеПособие</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаЗаСовмещение</name>
  </enumValues>
  <enumValues>
    <name>БолезньБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодамБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗаработокНаВремяТрудоустройства</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощь</name>
  </enumValues>
  <enumValues>
    <name>Льгота</name>
  </enumValues>
  <enumValues>
    <name>ВыбираемаяСотрудникомЛьгота</name>
  </enumValues>
  <enumValues>
    <name>НадбавкаЗаВредность</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНаСанаторноКурортноеЛечение</name>
  </enumValues>
  <enumValues>
    <name>Отгул</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПредыдущимиДокументами</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоДенежногоСодержанияЗаДниБолезни</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаНеотработанныеДниЧасыПриУвольнении</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаНеотработанныеДниПриУвольненииГосслужащего</name>
  </enumValues>
  <enumValues>
    <name>ДоначислениеДоУправленческогоУчета</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияМоральногоВреда</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/ВидыОсобыхНачисленийИУдержаний/ВидыОсобыхНачисленийИУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОсобыхНачисленийИУдержаний</name>
  <enumValues>
    <name>Дивиденды</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыСотрудников</name>
  </enumValues>
  <enumValues>
    <name>ДоговорАвторскогоЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ДоговорРаботыУслуги</name>
  </enumValues>
  <enumValues>
    <name>ДСВРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияЗаЗадержкуЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяВыгодаПоЗаймам</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМатериальнаяПомощь</name>
  </enumValues>
  <enumValues>
    <name>НачисленоПроцентовПоЗайму</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоначисленныйПоРезультатамПроверки</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоходыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>НДФЛЗачтено</name>
  </enumValues>
  <enumValues>
    <name>НДФЛКЗачету</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПередачаЗадолженностиВНалоговыйОрган</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>НДФЛРасчетыСБывшимиСотрудниками</name>
  </enumValues>
  <enumValues>
    <name>НФДЛДивиденды</name>
  </enumValues>
  <enumValues>
    <name>НФДЛДивидендыСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеЗаймаИзЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПриРожденииРебенка</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоЗайму</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьПодарковПризов</name>
  </enumValues>
  <enumValues>
    <name>ПособиеНаПогребение</name>
  </enumValues>
  <enumValues>
    <name>ПособиеНаПогребениеСотруднику</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Documents/СписокПолучателейГранта/СписокПолучателейГранта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписокПолучателейГранта</name>
  <registerRecords>InformationRegister.ПолучателиГрантов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Грант</name>
    <type>
      <types>CatalogRef.Гранты</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>EnumRef.ДействияСоСпискомПолучателейГрантов</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <comment>Краткий перечень сотрудников, включенных в документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияСПолучателямиГрантов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zup/ЗУП_бюджет/src/Catalogs/ТерриторииВыполненияРабот/ТерриторииВыполненияРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТерриторииВыполненияРабот</name>
  <basedOn>Catalog.Организации</basedOn>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициентРФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСудамЗарегистрированнымВРоссийскомМеждународномРеестреСудов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКоличествоДополнительныхДнейОтпускаВГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСевернойНадбавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависимыеСтажи</name>
    <attributes>
      <name>ВидСтажа</name>
      <type>
        <types>CatalogRef.ВидыСтажа</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

zup/ЗУП_бюджет/src/Catalogs/Гранты/Гранты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Гранты</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяФинансирования</name>
    <type>
      <types>CatalogRef.СтатьиФинансированияЗарплата</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

zup/ЗУП_бюджет/src/CommonModules/ГрантыНеоблагаемыеНДФЛ/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Гранты необлагаемые НДФЛ".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ДатыЗапретаИзмененияДанных

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписокПолучателейГранта", "Месяц",	"Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПолучателиГрантов", "Период",	"Зарплата", "");
	
КонецПроцедуры

#КонецОбласти

// Дополняет таблицу начислений колонкой СуммаЗаСчетГрантов, рассчитывая ее значение.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - содержит таблицу начислений и таблицу с бухучетом начислений.
//	ИмяВТНачисления - Строка - имя таблицы с начислениями.
//	ИмяВТБухучетНачислений - Строка - имя таблицы с бухучетом начислений.
//
Процедура ВыделитьСуммуЗаСчетГрантовИзНачислений(МенеджерВременныхТаблиц, ИмяВТНачисления = "ВТНачисления", ИмяВТБухучетНачислений = "ВТНачисленияСРаспределением") Экспорт
	
	Если Не СоздатьВТПолучателиГрантов(МенеджерВременныхТаблиц, ИмяВТБухучетНачислений) Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьВТ = Новый Массив;
	УдалитьВТ.Добавить("ВТПолучателиГрантов");
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КатегорииНачислений", КатегорииНачисленийВыплачиваемыеИзГрантов());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БухучетНачислений.ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА БухучетНачислений.Территория <> ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка)
	|			ТОГДА БухучетНачислений.Территория
	|		ИНАЧЕ БухучетНачислений.Подразделение
	|	КОНЕЦ КАК Территория,
	|	СУММА(БухучетНачислений.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТВыплачиваемыеИзГрантовНачисления
	|ИЗ
	|	ВТПолучателиГрантов КАК ПолучателиГрантов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБухучетНачислений КАК БухучетНачислений
	|		ПО (БухучетНачислений.Сотрудник = ПолучателиГрантов.Сотрудник)
	|			И (БухучетНачислений.ДатаНачала = ПолучателиГрантов.Период)
	|			И (БухучетНачислений.СтатьяФинансирования = ПолучателиГрантов.СтатьяФинансирования)
	|			И (БухучетНачислений.Начисление.КатегорияНачисленияИлиНеоплаченногоВремени В (&КатегорииНачислений))
	|
	|СГРУППИРОВАТЬ ПО
	|	БухучетНачислений.ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА БухучетНачислений.Территория <> ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка)
	|			ТОГДА БухучетНачислений.Территория
	|		ИНАЧЕ БухучетНачислений.Подразделение
	|	КОНЕЦ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТБухучетНачислений", ИмяВТБухучетНачислений);
	Запрос.Выполнить();
	
	УдалитьВТ.Добавить("ВТВыплачиваемыеИзГрантовНачисления");
	
	ПоляИсключения = Новый Массив;
	ПоляИсключения.Добавить("ИдентификаторСтроки");
	ПоляИсключения.Добавить("СуммаЗаСчетГрантов");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.ИдентификаторСтроки,
	|	ЕСТЬNULL(ВыплачиваемыеИзГрантовНачисления.Сумма, 0) КАК СуммаЗаСчетГрантов,
	|	&ИменаПолей
	|ПОМЕСТИТЬ ВТОтфильтрованныеНачисления
	|ИЗ
	|	ВТНачисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВыплачиваемыеИзГрантовНачисления КАК ВыплачиваемыеИзГрантовНачисления
	|		ПО Начисления.ИдентификаторСтроки = ВыплачиваемыеИзГрантовНачисления.ИдентификаторСтроки
	|			И Начисления.Подразделение = ВыплачиваемыеИзГрантовНачисления.Территория";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТНачисления", ИмяВТНачисления);
	ЗарплатаКадры.ЗаполнитьИменаПолейВТ(Запрос.Текст, МенеджерВременныхТаблиц, ИмяВТНачисления, "Начисления", ПоляИсключения);
	
	Запрос.Выполнить();
	
	УдалитьВТ.Добавить(ИмяВТНачисления);
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УдалитьВТ);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.*
	|ПОМЕСТИТЬ ВТНачисления
	|ИЗ
	|	ВТОтфильтрованныеНачисления КАК Начисления";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТНачисления", ИмяВТНачисления);
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТОтфильтрованныеНачисления");
	
КонецПроцедуры

// Исключает из доходов начисления по договорам подряда выплачиваемые из грантов.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - содержит таблицу с бухучетом начислений.
//	Доходы - ТаблицаЗначений - фильтруемая таблица начислений, как минимум, с колонками:
//		* ИдентификаторСтроки
//		* СуммаВычета
//		* СуммаДохода
//	ДополнительныеПараметры - Структура - содержит поля:
//		* ИмяВТБухучетНачислений - Строка - имя таблицы с бухучетом фильтруемых начислений.
//		* ИмяКолонкиИдентификаторСтроки - Строка - имя колонки из таблицы Доходы со значением ИдентификаторСтроки.
//		* ИмяКолонкиСуммаДохода - имя колонки из таблицы Доходы со значением СуммаДохода.
//
Процедура ОтобратьДоходыПоДоговорамПодрядаОблагаемыеНДФЛ(МенеджерВременныхТаблиц, Доходы, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Доходы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВТБухучетНачислений = "ВТНачисленияПоДоговорамСРаспределением";
	ИмяКолонкиИдентификаторСтроки = "ИдентификаторСтроки";
	ИмяКолонкиСуммаДохода = "СуммаДохода";
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		ИмяВТБухучетНачислений = ДополнительныеПараметры.ИмяВТБухучетНачислений;
		ИмяКолонкиИдентификаторСтроки = ДополнительныеПараметры.ИмяКолонкиИдентификаторСтроки;
		ИмяКолонкиСуммаДохода = ДополнительныеПараметры.ИмяКолонкиСуммаДохода;
	КонецЕсли;

	Если Не СоздатьВТПолучателиГрантов(МенеджерВременныхТаблиц, ИмяВТБухучетНачислений) Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьВТ = Новый Массив;
	УдалитьВТ.Добавить("ВТПолучателиГрантов");
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВидыНачислений", ВидыНачисленийВыплачиваемыеИзГрантов());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БухучетНачислений.ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА БухучетНачислений.Территория ЕСТЬ НЕ NULL 
	|				И БухучетНачислений.Территория <> НЕОПРЕДЕЛЕНО
	|				И БухучетНачислений.Территория <> ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка)
	|			ТОГДА БухучетНачислений.Территория
	|		ИНАЧЕ БухучетНачислений.Подразделение
	|	КОНЕЦ КАК ТерриторияВыполненияРабот,
	|	СУММА(БухучетНачислений.Сумма) КАК Сумма
	|ИЗ
	|	ВТПолучателиГрантов КАК ПолучателиГрантов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБухучетНачислений КАК БухучетНачислений
	|		ПО (БухучетНачислений.Сотрудник = ПолучателиГрантов.Сотрудник)
	|			И (БухучетНачислений.ДатаНачала = ПолучателиГрантов.Период)
	|			И (БухучетНачислений.СтатьяФинансирования = ПолучателиГрантов.СтатьяФинансирования)
	|			И (БухучетНачислений.Начисление В (&ВидыНачислений))
	|
	|СГРУППИРОВАТЬ ПО
	|	БухучетНачислений.ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА БухучетНачислений.Территория ЕСТЬ НЕ NULL 
	|				И БухучетНачислений.Территория <> НЕОПРЕДЕЛЕНО
	|				И БухучетНачислений.Территория <> ЗНАЧЕНИЕ(Справочник.ТерриторииВыполненияРабот.ПустаяСсылка)
	|			ТОГДА БухучетНачислений.Территория
	|		ИНАЧЕ БухучетНачислений.Подразделение
	|	КОНЕЦ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТБухучетНачислений", ИмяВТБухучетНачислений);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ИзменяемыеСтроки = Доходы.НайтиСтроки(Новый Структура(ИмяКолонкиИдентификаторСтроки + ", Подразделение", Выборка.ИдентификаторСтроки, Выборка.ТерриторияВыполненияРабот));
		Если ИзменяемыеСтроки.Количество() > 0 Тогда
			
			ИзменяемыеСтроки[0].СуммаВычета = ИзменяемыеСтроки[0].СуммаВычета * (1 - Выборка.Сумма / ИзменяемыеСтроки[0][ИмяКолонкиСуммаДохода]);
			ИзменяемыеСтроки[0][ИмяКолонкиСуммаДохода] = ИзменяемыеСтроки[0][ИмяКолонкиСуммаДохода] - Выборка.Сумма;
			
			Если ИзменяемыеСтроки[0][ИмяКолонкиСуммаДохода] = 0 
				И ИзменяемыеСтроки[0].СуммаВычета = 0 Тогда
				Доходы.Удалить(ИзменяемыеСтроки[0]);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УдалитьВТ);
	
КонецПроцедуры

// Удаляет из временной таблицы ИмяВТБухучетНачислений строки, которые относятся к грантам.
//
// Параметры:
//	МенеджерВременныхТаблиц - Менеджер временных таблиц - содержит таблицу с бухучетом начислений,
//								в которой есть поля: Сотрудник, ДатаНачала, СтатьяФинансирования, Начисление.
//
//	ИмяВТБухучетНачислений - Строка - имя таблицы с бухучетом начислений.
//
Процедура УдалитьСуммыЗаСчетГрантовВТаблицеБухучетНачислений(МенеджерВременныхТаблиц, ИмяВТБухучетНачислений) Экспорт
	
	Если Не СоздатьВТПолучателиГрантов(МенеджерВременныхТаблиц, ИмяВТБухучетНачислений) Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьВТ = Новый Массив;
	УдалитьВТ.Добавить("ВТПолучателиГрантов");
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("КатегорииНачислений", КатегорииНачисленийВыплачиваемыеИзГрантов());
	Запрос.УстановитьПараметр("ВидыНачислений", ВидыНачисленийВыплачиваемыеИзГрантов());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БухучетНачислений.Сотрудник,
	|	БухучетНачислений.Начисление,
	|	БухучетНачислений.СтатьяФинансирования,
	|	БухучетНачислений.ДатаНачала
	|ПОМЕСТИТЬ ВТИсключаемыеНачисления
	|ИЗ
	|	ВТПолучателиГрантов КАК ПолучателиГрантов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБухучетНачислений КАК БухучетНачислений
	|		ПО (БухучетНачислений.Сотрудник = ПолучателиГрантов.Сотрудник)
	|			И (БухучетНачислений.ДатаНачала = ПолучателиГрантов.Период)
	|			И (БухучетНачислений.СтатьяФинансирования = ПолучателиГрантов.СтатьяФинансирования)
	|			И (ВЫРАЗИТЬ(БухучетНачислений.Начисление КАК ПланВидовРасчета.Начисления).КатегорияНачисленияИлиНеоплаченногоВремени В (&КатегорииНачислений))
	|
	|СГРУППИРОВАТЬ ПО
	|	БухучетНачислений.Сотрудник,
	|	БухучетНачислений.Начисление,
	|	БухучетНачислений.СтатьяФинансирования,
	|	БухучетНачислений.ДатаНачала
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БухучетНачислений.Сотрудник,
	|	БухучетНачислений.Начисление,
	|	БухучетНачислений.СтатьяФинансирования,
	|	БухучетНачислений.ДатаНачала
	|ИЗ
	|	ВТПолучателиГрантов КАК ПолучателиГрантов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТБухучетНачислений КАК БухучетНачислений
	|		ПО (БухучетНачислений.Сотрудник = ПолучателиГрантов.Сотрудник)
	|			И (БухучетНачислений.ДатаНачала = ПолучателиГрантов.Период)
	|			И (БухучетНачислений.СтатьяФинансирования = ПолучателиГрантов.СтатьяФинансирования)
	|			И (БухучетНачислений.Начисление В (&ВидыНачислений))
	|
	|СГРУППИРОВАТЬ ПО
	|	БухучетНачислений.Сотрудник,
	|	БухучетНачислений.Начисление,
	|	БухучетНачислений.СтатьяФинансирования,
	|	БухучетНачислений.ДатаНачала";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТБухучетНачислений", ИмяВТБухучетНачислений);
	Запрос.Выполнить();
	
	УдалитьВТ.Добавить("ВТИсключаемыеНачисления");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ИменаПолей
	|ПОМЕСТИТЬ ВТОтфильтрованныйБухучетНачислений
	|ИЗ
	|	ВТБухучетНачислений КАК БухучетНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсключаемыеНачисления КАК ИсключаемыеНачисления
	|		ПО БухучетНачислений.Сотрудник = ИсключаемыеНачисления.Сотрудник
	|			И БухучетНачислений.ДатаНачала = ИсключаемыеНачисления.ДатаНачала
	|			И БухучетНачислений.СтатьяФинансирования = ИсключаемыеНачисления.СтатьяФинансирования
	|			И БухучетНачислений.Начисление = ИсключаемыеНачисления.Начисление
	|ГДЕ
	|	ИсключаемыеНачисления.Сотрудник ЕСТЬ NULL";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТБухучетНачислений", ИмяВТБухучетНачислений);
	ЗарплатаКадры.ЗаполнитьИменаПолейВТ(Запрос.Текст, МенеджерВременныхТаблиц, ИмяВТБухучетНачислений, "БухучетНачислений", Новый Массив);
	
	Запрос.Выполнить();
	
	УдалитьВТ.Добавить(ИмяВТБухучетНачислений);
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УдалитьВТ);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БухучетНачислений.*
	|ПОМЕСТИТЬ ВТБухучетНачислений
	|ИЗ
	|	ВТОтфильтрованныйБухучетНачислений КАК БухучетНачислений";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТБухучетНачислений", ИмяВТБухучетНачислений);
	Запрос.Выполнить();
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, "ВТОтфильтрованныйБухучетНачислений");
	
КонецПроцедуры

Функция СтрокиИзмениласьДоляГранта(МенеджерВременныхТаблиц,ИмяВТСтарыйБухучетНачислений,ИмяВТНовыйБухучетНачислений) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("КатегорииНачислений", КатегорииНачисленийВыплачиваемыеИзГрантов());
	Запрос.УстановитьПараметр("ВидыНачислений", ВидыНачисленийВыплачиваемыеИзГрантов());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БухучетНачислений.ИдентификаторСтроки,
	|	СУММА(БухучетНачислений.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТСтарыеСтроки
	|ИЗ
	|	ВТПолучателиГрантов КАК ПолучателиГрантов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтарыйБухучетНачислений КАК БухучетНачислений
	|		ПО (БухучетНачислений.Сотрудник = ПолучателиГрантов.Сотрудник)
	|			И (БухучетНачислений.ДатаНачала = ПолучателиГрантов.Период)
	|			И (БухучетНачислений.СтатьяФинансирования = ПолучателиГрантов.СтатьяФинансирования)
	|			И (ВЫРАЗИТЬ(БухучетНачислений.Начисление КАК ПланВидовРасчета.Начисления).КатегорияНачисленияИлиНеоплаченногоВремени В (&КатегорииНачислений))
	|
	|СГРУППИРОВАТЬ ПО
	|	БухучетНачислений.ИдентификаторСтроки
	|
	|ИМЕЮЩИЕ
	|	СУММА(БухучетНачислений.Сумма) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БухучетНачислений.ИдентификаторСтроки,
	|	СУММА(БухучетНачислений.Сумма)
	|ИЗ
	|	ВТПолучателиГрантов КАК ПолучателиГрантов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтарыйБухучетНачислений КАК БухучетНачислений
	|		ПО (БухучетНачислений.Сотрудник = ПолучателиГрантов.Сотрудник)
	|			И (БухучетНачислений.ДатаНачала = ПолучателиГрантов.Период)
	|			И (БухучетНачислений.СтатьяФинансирования = ПолучателиГрантов.СтатьяФинансирования)
	|			И (БухучетНачислений.Начисление В (&ВидыНачислений))
	|
	|СГРУППИРОВАТЬ ПО
	|	БухучетНачислений.ИдентификаторСтроки
	|
	|ИМЕЮЩИЕ
	|	СУММА(БухучетНачислений.Сумма) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БухучетНачислений.ИдентификаторСтроки,
	|	СУММА(БухучетНачислений.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТНовыеСтроки
	|ИЗ
	|	ВТПолучателиГрантов КАК ПолучателиГрантов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНовыйБухучетНачислений КАК БухучетНачислений
	|		ПО (БухучетНачислений.Сотрудник = ПолучателиГрантов.Сотрудник)
	|			И (БухучетНачислений.ДатаНачала = ПолучателиГрантов.Период)
	|			И (БухучетНачислений.СтатьяФинансирования = ПолучателиГрантов.СтатьяФинансирования)
	|			И (ВЫРАЗИТЬ(БухучетНачислений.Начисление КАК ПланВидовРасчета.Начисления).КатегорияНачисленияИлиНеоплаченногоВремени В (&КатегорииНачислений))
	|
	|СГРУППИРОВАТЬ ПО
	|	БухучетНачислений.ИдентификаторСтроки
	|
	|ИМЕЮЩИЕ
	|	СУММА(БухучетНачислений.Сумма) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БухучетНачислений.ИдентификаторСтроки,
	|	СУММА(БухучетНачислений.Сумма)
	|ИЗ
	|	ВТПолучателиГрантов КАК ПолучателиГрантов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНовыйБухучетНачислений КАК БухучетНачислений
	|		ПО (БухучетНачислений.Сотрудник = ПолучателиГрантов.Сотрудник)
	|			И (БухучетНачислений.ДатаНачала = ПолучателиГрантов.Период)
	|			И (БухучетНачислений.СтатьяФинансирования = ПолучателиГрантов.СтатьяФинансирования)
	|			И (БухучетНачислений.Начисление В (&ВидыНачислений))
	|
	|СГРУППИРОВАТЬ ПО
	|	БухучетНачислений.ИдентификаторСтроки
	|
	|ИМЕЮЩИЕ
	|	СУММА(БухучетНачислений.Сумма) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиГрантов.ИдентификаторСтроки,
	|	СУММА(ЕСТЬNULL(СтрокиГрантов.СтараяСумма, 0)) КАК СтараяСумма,
	|	СУММА(ЕСТЬNULL(СтрокиГрантов.НоваяСумма, 0)) КАК НоваяСумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтарыеСтроки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		СтарыеСтроки.Сумма КАК СтараяСумма,
	|		0 КАК НоваяСумма
	|	ИЗ
	|		ВТСтарыеСтроки КАК СтарыеСтроки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НовыеСтроки.ИдентификаторСтроки,
	|		0,
	|		НовыеСтроки.Сумма
	|	ИЗ
	|		ВТНовыеСтроки КАК НовыеСтроки) КАК СтрокиГрантов
	|
	|СГРУППИРОВАТЬ ПО
	|	СтрокиГрантов.ИдентификаторСтроки
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(СтрокиГрантов.СтараяСумма, 0)) <> СУММА(ЕСТЬNULL(СтрокиГрантов.НоваяСумма, 0))";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТСтарыйБухучетНачислений", ИмяВТСтарыйБухучетНачислений);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТНовыйБухучетНачислений", ИмяВТНовыйБухучетНачислений);
	Результат = Запрос.Выполнить();
	
	СтрокиИзмениласьДоляГранта = Новый Соответствие;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокиИзмениласьДоляГранта.Вставить(Выборка.ИдентификаторСтроки, Истина);
	КонецЦикла;
	
	Возврат СтрокиИзмениласьДоляГранта;
	
КонецФункции

Функция СтатьиФинансированияГранта(Сотрудник, ВидРасчета, ДатаНачала) Экспорт
	
	СтатьиФинансирования = Новый Массив;
	
	КатегорияНачисления = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПустаяСсылка();
	Если ТипЗнч(ВидРасчета) = Тип("ПланВидовРасчетаСсылка.Начисления") Тогда
		КатегорияНачисления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидРасчета, "КатегорияНачисленияИлиНеоплаченногоВремени");
	КонецЕсли;
	
	Если КатегорииНачисленийВыплачиваемыеИзГрантов().Найти(КатегорияНачисления) = Неопределено
		И ВидыНачисленийВыплачиваемыеИзГрантов().Найти(ВидРасчета) = Неопределено Тогда
		Возврат СтатьиФинансирования;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Сотрудник КАК Сотрудник,
	|	&ДатаНачала КАК ДатаНачала
	|ПОМЕСТИТЬ ВТОтборСотрудников";
	Запрос.Выполнить();
	
	Если Не СоздатьВТПолучателиГрантов(Запрос.МенеджерВременныхТаблиц, "ВТОтборСотрудников") Тогда
		Возврат СтатьиФинансирования;
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПолучателиГрантов.СтатьяФинансирования
	|ИЗ
	|	ВТПолучателиГрантов КАК ПолучателиГрантов";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтатьиФинансирования.Добавить(Выборка.СтатьяФинансирования);
	КонецЦикла;
	
	Возврат СтатьиФинансирования;
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.4.20";
	Обработчик.Процедура = "ГрантыНеоблагаемыеНДФЛ.УстановитьПараметрыНабораСвойствСправочников";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d4d69d09-3dfc-4d46-bee7-0650db51a3ff");
	Обработчик.Комментарий = НСтр("ru = 'Установка параметров для набора свойств справочника грантов. Дополнительные реквизиты в грантах временно недоступны.'");
	
КонецПроцедуры

Процедура УстановитьПараметрыНабораСвойствСправочников(ПараметрыОбновления = НеОпределено) Экспорт
	
	ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	ПараметрыНабора.Используется = Константы.ИспользоватьГрантыНеоблагаемыеНДФЛ.Получить();
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_Гранты", ПараметрыНабора);
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИспользуютсяГрантыНеоблагаемыеНДФЛ() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьГрантыНеоблагаемыеНДФЛ");
	
КонецФункции

Функция КатегорииНачисленийВыплачиваемыеИзГрантов()
	
	КатегорииНачислений = Новый Массив;
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПовременнаяОплатаТруда);
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.СдельнаяОплатаТруда);
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ДоходВНатуральнойФорме);
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КомпенсационныеВыплаты);
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Премия);
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.РайонныйКоэффициент);
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.СевернаяНадбавка);
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска);
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска);
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаКомандировки);
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаПоСреднемуЗаработку);
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ДоплатаЗаСовмещение);
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.НадбавкаЗаВредность);
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Прочее);
	
	Возврат КатегорииНачислений;
	
КонецФункции

Функция ВидыНачисленийВыплачиваемыеИзГрантов()
	
	ВидыНачислений = Новый Массив;
	ВидыНачислений.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ДоговорАвторскогоЗаказа);
	ВидыНачислений.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги);
	
	Возврат ВидыНачислений;
	
КонецФункции

// Формирует временную таблицу ВТПолучателиГрантов, список сотрудников и периодов,
// по которым необходимо получить данные, берутся из временной таблицы в менеджере временных
// таблиц, переданном в качестве параметра. Временная таблица обязательно должна содержать
// колонки Сотрудник и Период.
//
// Параметры:
//	МенеджерВременныхТаблиц - Менеджер временных таблиц - содержит таблицу с данными для отборов.
//	ИмяВременнойТаблицыОтборов - Строка, имя временной таблицы в менеджере запросов.
//	ИмяПоляСотрудник - Строка, указывает имя поля временной таблицы,
//						содержащего ссылку на сотрудника.
//	ИмяПоляПериод - Строка, указывает имя поля временной таблицу, содержащее период,
//					 на который определяется статус получателя гранта.
//
// Возвращаемое значение:
//	Булево - признак того, что таблица создана и она не пуста.
//
Функция СоздатьВТПолучателиГрантов(МенеджерВременныхТаблиц, ИмяВременнойТаблицыОтборов, ИмяПоляСотрудник = "Сотрудник", ИмяПоляПериод = "ДатаНачала") Экспорт
	
	Если Не ИспользуютсяГрантыНеоблагаемыеНДФЛ() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОтборов.Период КАК Период,
	|	ТаблицаОтборов.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТФильтрПолучателиГрантов
	|ИЗ
	|	ВТОтборовСотрудников КАК ТаблицаОтборов";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОтборов.Сотрудник", "ТаблицаОтборов." + ИмяПоляСотрудник);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОтборов.Период", "ТаблицаОтборов." + ИмяПоляПериод);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТОтборовСотрудников", ИмяВременнойТаблицыОтборов);
	
	Запрос.Выполнить();
	
	УдалитьВТ = Новый Массив;
	УдалитьВТ.Добавить("ВТФильтрПолучателиГрантов");
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ПолучателиГрантов",
		МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТФильтрПолучателиГрантов",
			"Сотрудник"));
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ПолучателиГрантов.Период КАК Период,
	|	ПолучателиГрантов.Сотрудник КАК Сотрудник,
	|	ПолучателиГрантов.Грант КАК Грант,
	|	Гранты.СтатьяФинансирования КАК СтатьяФинансирования
	|ПОМЕСТИТЬ ВТПолучателиГрантов
	|ИЗ
	|	ВТПолучателиГрантовСрезПоследних КАК ПолучателиГрантов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Гранты КАК Гранты
	|		ПО ПолучателиГрантов.Грант = Гранты.Ссылка
	|			И (ПолучателиГрантов.Период МЕЖДУ Гранты.ДатаНачала И КОНЕЦПЕРИОДА(Гранты.ДатаОкончания, МЕСЯЦ))
	|ГДЕ
	|	ПолучателиГрантов.ЯвляетсяПолучателем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПолучателиГрантов.Сотрудник
	|ИЗ
	|	ВТПолучателиГрантов КАК ПолучателиГрантов";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаПуста = РезультатЗапроса.Пустой();
	
	УдалитьВТ.Добавить("ВТПолучателиГрантовСрезПоследних");
	
	Если ТаблицаПуста Тогда
		УдалитьВТ.Добавить("ВТПолучателиГрантов");
	КонецЕсли;
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УдалитьВТ);
	
	Возврат Не ТаблицаПуста;
	
КонецФункции

#Область НастройкаРасчетаЗарплаты

Функция ТребуютсяГранты()
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы")
		И ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении");
	
КонецФункции

Процедура ДополнитьФормуНастройкаРасчетаЗарплаты(Форма) Экспорт
	
	Если Не ТребуютсяГранты() Тогда
		Возврат;
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользоватьГрантыНеоблагаемыеНДФЛ", Новый ОписаниеТипов("Булево"), , НСтр("ru='Использовать гранты необлагаемые НДФЛ'")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользоватьГрантыНеоблагаемыеНДФЛПрежняя", Новый ОписаниеТипов("Булево"), , НСтр("ru='Использовать гранты необлагаемые НДФЛ (прежняя)'")));
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
	Если Форма.Элементы.Найти("ИспользоватьГрантыНеоблагаемыеНДФЛ") = Неопределено Тогда
		
		ГруппаФормы = Форма.Элементы.ГруппаГрантыНеоблагаемыеНДФЛ;
		
		ПолеФлажка = Форма.Элементы.Вставить("ИспользоватьГрантыНеоблагаемыеНДФЛ", Тип("ПолеФормы"), ГруппаФормы);
		ПолеФлажка.ПутьКДанным = "ИспользоватьГрантыНеоблагаемыеНДФЛ";
		ПолеФлажка.Вид = ВидПоляФормы.ПолеФлажка;
		ПолеФлажка.Заголовок = НСтр("ru = 'Используются гранты необлагаемые НДФЛ'");
		ПолеФлажка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		ПолеФлажка.Подсказка = НСтр("ru = 'Выполнение начислений необлагаемых НДФЛ согласно п. 6 ст. 217 НК РФ.'");
		ПолеФлажка.РасширеннаяПодсказка.АвтоМаксимальнаяШирина = Ложь;
		ПолеФлажка.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		ПолеФлажка.УстановитьДействие("ПриИзменении", "Подключаемый_ИспользоватьГрантыНеоблагаемыеНДФЛПриИзменении");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НастройкиПрограммыВРеквизитыФормы(Форма) Экспорт
	
	Если Не ТребуютсяГранты() Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ИспользоватьГрантыНеоблагаемыеНДФЛ = ИспользуютсяГрантыНеоблагаемыеНДФЛ();
	
КонецПроцедуры

Процедура ДополнитьСтруктуруПараметровНастроек(СтруктураПараметров) Экспорт
	
	Если Не ТребуютсяГранты() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров.ПараметрыНастроек.Вставить("ИспользоватьГрантыНеоблагаемыеНДФЛ", Ложь);
	СтруктураПараметров.Вставить("ИспользоватьГрантыНеоблагаемыеНДФЛ")
	
КонецПроцедуры

Процедура ЗначенияСохраняемыхРеквизитовФормыНастройкаПрограммы(Форма, Параметры) Экспорт
	
	Если Не ТребуютсяГранты() Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.ПараметрыНастроек.ИспользоватьГрантыНеоблагаемыеНДФЛ 
		Или Параметры.ПараметрыНастроек.ИспользоватьНачислениеЗарплаты Тогда
		
		Параметры.Вставить("ИспользоватьГрантыНеоблагаемыеНДФЛ", Форма.ИспользоватьГрантыНеоблагаемыеНДФЛ);
		Форма.ИспользоватьГрантыНеоблагаемыеНДФЛПрежняя = Форма.ИспользоватьГрантыНеоблагаемыеНДФЛ;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьНастройкиПрограммы(Параметры) Экспорт
	
	Если Не ТребуютсяГранты() Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.ПараметрыНастроек.ИспользоватьГрантыНеоблагаемыеНДФЛ 
		Или Параметры.ПараметрыНастроек.ИспользоватьНачислениеЗарплаты Тогда
		Константы.ИспользоватьГрантыНеоблагаемыеНДФЛ.Установить(Параметры.ИспользоватьГрантыНеоблагаемыеНДФЛ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПоказательИспользоватьГрантыНеоблагаемыеНДФЛ(ТаблицаПоказателей) Экспорт
	
	Если Не ТребуютсяГранты() Тогда
		Возврат;
	КонецЕсли;
	
	Отчеты.НастройкиПрограммыЗарплатаКадры.ДобавитьПоказатель(ТаблицаПоказателей, "Константы", "ИспользоватьГрантыНеоблагаемыеНДФЛ", 
		НСтр("ru = 'Используются гранты необлагаемые НДФЛ'"), "Расчет зарплаты", "", "Ложь", 4, 1, 23);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
